# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-vQCX2ZXrYG9okRG5

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.customer.data.tfe_organization.default: Refreshing...
module.organization.data.tfe_organization.default: Refreshing...
module.identity.data.tfe_organization.default: Refreshing...
module.customer.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.customer.tfe_project.default: Refreshing state... [id=prj-dYLFGqXmntwZ4GUw]
module.customer.data.tfe_workspace.default: Refreshing...
module.organization.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.organization.data.tfe_workspace.default: Refreshing...
module.organization.tfe_project.default: Refreshing state... [id=prj-SLwbyJaqbnV7HsWf]
module.identity.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.identity.tfe_project.default: Refreshing state... [id=prj-kBj4zxTkpQA4vrdP]
module.identity.data.tfe_workspace.default: Refreshing...
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-UccQLXJm1cF5D75K]
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-r5N5oms1eT4aAn3F]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-4r1XaS9fcHRPPUKm]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-g9ya5niXkQvTRtHz]
module.organization.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.organization.data.tfe_variables.default: Refreshing...
module.customer.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.customer.data.tfe_variables.default: Refreshing...
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-6AtEsim9BJA8wMNw]
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-NLWagJurcZ6WZYRU]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-hzjDjsWgpawH9Ur7]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-j7iA6t3KrZRqmLby]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-Te85ewrEjnHenqpY]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-wrwLaSxhKb9Uemfp]
module.identity.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-YSKkPW7uLaVKPd6o]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-dkhebmLC1tzSyNvi]
module.customer.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-wwXQa69M62VYdb4M]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-Ck3HTj6gfiSDsZ2t]
module.identity.data.tfe_variables.default: Refreshing...
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-taRawqtCexfMr3Dx]
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-1Pm6MjjFJ2L6kkfi]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-Xe8b3TDZDqXoDokT]
module.organization.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-wwXQa69M62VYdb4M]
module.identity.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-wwXQa69M62VYdb4M]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-dYLFGqXmntwZ4GUw"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/shared/infrastructure/workspaces/staging"
    }

  # module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-dYLFGqXmntwZ4GUw"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/staging"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*